### 08/05/25

- In Pandas we can join two dataframes
   - merge
   - join
   - concat

### merge

- it is under the function : pd.merge
- it similar to SQL joins
- you can join  with specific columns

In [24]:
import pandas as pd

In [25]:
d1={'ID':[1,2,3],
   'Name':['Sonam','Sabnam','Yasmin']}
d2={'ID':[1,2,4],
   'Age':[24,26,28]}

In [9]:
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [10]:
df1

   ID    Name
0   1   Sonam
1   2  Sabnam
2   3  Yasmin

In [11]:
df2

   ID  Age
0   1   24
1   2   26
2   4   28

In [9]:
pd.merge(df1,df2,on='ID',how='inner')

   ID    Name  Age
0   1   Sonam   24
1   2  Sabnam   26

In [10]:
pd.merge(df1,df2,on='ID',how='outer')

   ID    Name   Age
0   1   Sonam  24.0
1   2  Sabnam  26.0
2   3  Yasmin   NaN
3   4     NaN  28.0

In [11]:
pd.merge(df1,df2,on='ID',how='left')

   ID    Name   Age
0   1   Sonam  24.0
1   2  Sabnam  26.0
2   3  Yasmin   NaN

In [12]:
pd.merge(df1,df2,on='ID',how='right')

   ID    Name  Age
0   1   Sonam   24
1   2  Sabnam   26
2   4     NaN   28

In [ ]:
## homework
df1.join(df2)


pd.concat([df1,df2])

#### join

In [13]:
df2=df2.set_index('ID')
df1.join(df2,on='ID',how='inner')

   ID    Name  Age
0   1   Sonam   24
1   2  Sabnam   26

In [19]:
df1.join(df2,on='ID',how='outer')

     ID    Name   Age
1.0   1   Sonam  24.0
2.0   2  Sabnam  26.0
3.0   3  Yasmin   NaN
NaN   4     NaN  28.0

In [20]:
df1.join(df2,on='ID',how='left')

      Name   Age
ID
1    Sonam  24.0
2   Sabnam  26.0
3   Yasmin   NaN

In [21]:
df1.join(df2,on='ID',how='right')

     ID    Name  Age
1.0   1   Sonam   24
2.0   2  Sabnam   26
NaN   4     NaN   28

#### concat

In [27]:
pd.concat([df1,df2])

      Name   Age
ID
1    Sonam   NaN
2   Sabnam   NaN
3   Yasmin   NaN
1      NaN  24.0
2      NaN  26.0
4      NaN  28.0

In [28]:
pd.concat([df1,df2],axis=0)

      Name   Age
ID
1    Sonam   NaN
2   Sabnam   NaN
3   Yasmin   NaN
1      NaN  24.0
2      NaN  26.0
4      NaN  28.0

In [29]:
pd.concat([df1,df2],axis=1)

      Name   Age
ID
1    Sonam  24.0
2   Sabnam  26.0
3   Yasmin   NaN
4      NaN  28.0

In [32]:
pd.concat([df1,df2],axis=1,join='outer')

      Name   Age
ID
1    Sonam  24.0
2   Sabnam  26.0
3   Yasmin   NaN
4      NaN  28.0

In [33]:
pd.concat([df1,df2],axis=1,join='inner')

      Name  Age
ID
1    Sonam   24
2   Sabnam   26

====================================== EDA  Steps ======================================

--------------------- DATA cleaning and analysis ---------------

- Read the data
- Create categorical and numerical columns
- Data quick checks
  
  A) shape   B) Size   C) len    D) Head   E) Tail
  F) info
  
- Missing value analysis
- Data quality checks or Data cleaning
  - Ex: some column values has some punctuations
  - column is numerical value
  - but some where cat value available
    
- Categorical column analysis
  
  A) Frequency table  B) Relative frequency
  C) Bar Chart        D) pie chart
  
- Write your understanding
  
- Outliers analysis 
   A) Box plot
   B) Treat the outliers
  
- Bi variate and Multi variate analysis

  A) How one column impact another column
  B) Correlation    C) Heatmaps

------------------------- Feature
Engineering -----------------------

10. Encoding : Convert categorical to Numerical
      A) Label Encoder      B) OneHotEncoder
11. Scaling :
      A) Standardization  and  B) Normalization
12. Transformation  (optional)
----    --Feature Selection ---------------
13. Selecting the Important features for ML model

-----------------  Dimension Reduction methods   -------------------

14. Principle Component Analysis
    Singular value Decompositions
    Develope the ML models